* NGRIP
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | NGRIP
Place name                       | NGRIP
Geographic location              | Central Greenland
Ice type                         | Ice sheet
Data Source                      | Clow email
Data DOI                         | 
Science Source                   | Buchardt, S. and D. Dahl-Jensen. 2007. Estimating the basal melt rate at NorthGRIP using a Monte Carlo technique. Annals of Glaciology. 45: 137-142. 
Science DOI                      | 10.3189/172756407782282435
Date                             | 2003
Longitude [°E]                   | -42.32
Latitude [°N]                    | 75.1
Location Source                  | Vinther, 2008
Depth of top measurement [m]     | 82.0
Depth of bottom measurement [m]  | 2992
Ice thickness [m]                | 3085
Coverage [% of thickness]        | 94
Ice thickness source             | See data source email
Note                             | 
#+end_example

** Temperature

+ From G. Clow email

#+BEGIN_EXAMPLE
From: Gary D Clow
To: Ken Mankoff, William Colgan, Dorthe Dahl-Jensen
Subject: NGRIP-2 temperature log
Date: Sun 07 Feb 2021 08:16:34 PM PST
Attachments: [1]NGRIP-2_03MAY24.txt(14.0K), [2]NGRIP_Tz.jpg(303.5K),
 [3]NGRIP_dTdz.jpg(430.6K)

Attached is the final temperature log acquired in the NGRIP-2 borehole by
the USGS temperature logging system on 24 May 2003. We reached the bottom
at 2992.47 m below the surface according to our load cell.  Be aware that
drilling continued after this log was obtained; the hole ultimately reached
3085 m.  The attached temperature log has been denoised to remove
instrumental noise and deconvolved to account for the motion of the sensor
while logging.  The log has not been corrected for borehole refraction
effects or the thermal disturbance caused by drilling.  Fluid convection
cells are apparent in the log below 1750 m.
#+END_EXAMPLE

** Thickness

+ From data provided by G. Clow

** Location

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :results none
import numpy as np
import pandas as pd

df = pd.read_csv('NGRIP-2_03MAY24.txt', sep=' ', skipinitialspace=True, skiprows=24, names=['d','t'], index_col=0)
df.index.name = 'd'
df.to_csv('data.csv')
#+END_SRC

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|       d |        t |
|   81.89 | -31.6259 |
|    85.0 | -31.6276 |
|    90.0 | -31.6313 |
|    95.0 | -31.6312 |
|   100.0 | -31.6356 |
|   105.0 | -31.6447 |
|   110.0 | -31.6508 |
|   115.0 | -31.6553 |
|   120.0 | -31.6606 |
|   125.0 | -31.6656 |
|   130.0 |  -31.669 |
|   135.0 | -31.6727 |
|   140.0 | -31.6764 |
|   145.0 | -31.6786 |
|   150.0 | -31.6797 |
|   155.0 | -31.6802 |
|   160.0 | -31.6805 |
|   165.0 | -31.6803 |
|   170.0 | -31.6791 |
|   175.0 | -31.6774 |
|   180.0 | -31.6752 |
|   185.0 | -31.6747 |
|   190.0 | -31.6729 |
|   195.0 |   -31.67 |
|   200.0 | -31.6672 |
|   205.0 | -31.6636 |
|   210.0 |   -31.66 |
|   215.0 | -31.6561 |
|   220.0 | -31.6522 |
|   225.0 | -31.6479 |
|   230.0 | -31.6433 |
|   235.0 | -31.6385 |
|   240.0 | -31.6338 |
|   245.0 | -31.6288 |
|   250.0 | -31.6237 |
|   255.0 |  -31.619 |
|   260.0 | -31.6139 |
|   265.0 |  -31.609 |
|   270.0 | -31.6042 |
|   275.0 | -31.5993 |
|   280.0 | -31.5944 |
|   285.0 | -31.5895 |
|   290.0 | -31.5848 |
|   295.0 | -31.5805 |
|   300.0 | -31.5756 |
|   305.0 | -31.5714 |
|   310.0 | -31.5671 |
|   315.0 | -31.5628 |
|   320.0 | -31.5587 |
|   325.0 | -31.5552 |
|   330.0 |  -31.551 |
|   335.0 | -31.5474 |
|   340.0 | -31.5441 |
|   345.0 | -31.5409 |
|   350.0 | -31.5376 |
|   355.0 | -31.5347 |
|   360.0 | -31.5319 |
|   365.0 | -31.5296 |
|   370.0 | -31.5263 |
|   375.0 | -31.5236 |
|   380.0 | -31.5206 |
|   385.0 | -31.5168 |
|   390.0 | -31.5143 |
|   395.0 |  -31.515 |
|   400.0 |  -31.515 |
|   405.0 | -31.5138 |
|   410.0 | -31.5127 |
|   415.0 | -31.5114 |
|   420.0 | -31.5105 |
|   425.0 | -31.5098 |
|   430.0 |  -31.509 |
|   435.0 | -31.5082 |
|   440.0 | -31.5076 |
|   445.0 | -31.5076 |
|   450.0 | -31.5074 |
|   455.0 | -31.5077 |
|   460.0 | -31.5079 |
|   465.0 | -31.5081 |
|   470.0 | -31.5085 |
|   475.0 | -31.5091 |
|   480.0 | -31.5095 |
|   485.0 | -31.5102 |
|   490.0 | -31.5109 |
|   495.0 | -31.5117 |
|   500.0 | -31.5132 |
|   505.0 | -31.5151 |
|   510.0 | -31.5164 |
|   515.0 |  -31.518 |
|   520.0 | -31.5202 |
|   525.0 | -31.5215 |
|   530.0 | -31.5227 |
|   535.0 | -31.5252 |
|   540.0 | -31.5283 |
|   545.0 | -31.5309 |
|   550.0 | -31.5332 |
|   555.0 | -31.5359 |
|   560.0 | -31.5373 |
|   565.0 | -31.5392 |
|   570.0 | -31.5414 |
|   575.0 | -31.5443 |
|   580.0 | -31.5461 |
|   585.0 | -31.5483 |
|   590.0 | -31.5513 |
|   595.0 |  -31.554 |
|   600.0 | -31.5564 |
|   605.0 | -31.5637 |
|   610.0 | -31.5665 |
|   615.0 | -31.5718 |
|   620.0 | -31.5759 |
|   625.0 | -31.5804 |
|   630.0 | -31.5837 |
|   635.0 | -31.5871 |
|   640.0 | -31.5925 |
|   645.0 | -31.5973 |
|   650.0 |  -31.602 |
|   655.0 |  -31.607 |
|   660.0 |  -31.613 |
|   665.0 | -31.6166 |
|   670.0 | -31.6216 |
|   675.0 |  -31.627 |
|   680.0 | -31.6321 |
|   685.0 | -31.6382 |
|   690.0 | -31.6439 |
|   695.0 | -31.6482 |
|   700.0 | -31.6534 |
|   705.0 | -31.6595 |
|   710.0 | -31.6653 |
|   715.0 | -31.6721 |
|   720.0 | -31.6778 |
|   725.0 | -31.6843 |
|   730.0 | -31.6894 |
|   735.0 | -31.6964 |
|   740.0 |  -31.701 |
|   745.0 | -31.7078 |
|   750.0 | -31.7148 |
|   755.0 | -31.7207 |
|   760.0 | -31.7278 |
|   765.0 | -31.7336 |
|   770.0 | -31.7404 |
|   775.0 | -31.7469 |
|   780.0 | -31.7533 |
|   785.0 | -31.7606 |
|   790.0 | -31.7667 |
|   795.0 | -31.7745 |
|   800.0 | -31.7808 |
|   805.0 | -31.7881 |
|   810.0 |  -31.796 |
|   815.0 | -31.8025 |
|   820.0 | -31.8097 |
|   825.0 | -31.8155 |
|   830.0 | -31.8232 |
|   835.0 | -31.8296 |
|   840.0 | -31.8388 |
|   845.0 | -31.8448 |
|   850.0 | -31.8519 |
|   855.0 | -31.8591 |
|   860.0 | -31.8675 |
|   865.0 | -31.8742 |
|   870.0 | -31.8823 |
|   875.0 | -31.8891 |
|   880.0 | -31.8969 |
|   885.0 |  -31.904 |
|   890.0 |  -31.912 |
|   895.0 | -31.9186 |
|   900.0 | -31.9261 |
|   905.0 | -31.9337 |
|   910.0 | -31.9421 |
|   915.0 | -31.9489 |
|   920.0 | -31.9577 |
|   925.0 | -31.9639 |
|   930.0 |  -31.972 |
|   935.0 | -31.9788 |
|   940.0 | -31.9868 |
|   945.0 | -31.9944 |
|   950.0 | -32.0028 |
|   955.0 | -32.0103 |
|   960.0 | -32.0189 |
|   965.0 | -32.0247 |
|   970.0 | -32.0335 |
|   975.0 | -32.0408 |
|   980.0 | -32.0476 |
|   985.0 | -32.0557 |
|   990.0 | -32.0627 |
|   995.0 | -32.0709 |
|  1000.0 | -32.0783 |
|  1005.0 | -32.0856 |
|  1010.0 | -32.0931 |
|  1015.0 | -32.1005 |
|  1020.0 |  -32.108 |
|  1025.0 | -32.1152 |
|  1030.0 | -32.1229 |
|  1035.0 | -32.1296 |
|  1040.0 | -32.1367 |
|  1045.0 | -32.1434 |
|  1050.0 | -32.1508 |
|  1055.0 |  -32.157 |
|  1060.0 | -32.1636 |
|  1065.0 | -32.1708 |
|  1070.0 | -32.1776 |
|  1075.0 | -32.1843 |
|  1080.0 | -32.1904 |
|  1085.0 | -32.1982 |
|  1090.0 | -32.2035 |
|  1095.0 | -32.2107 |
|  1100.0 | -32.2179 |
|  1105.0 | -32.2239 |
|  1110.0 | -32.2296 |
|  1115.0 | -32.2349 |
|  1120.0 |  -32.241 |
|  1125.0 | -32.2468 |
|  1130.0 | -32.2523 |
|  1135.0 | -32.2604 |
|  1140.0 | -32.2651 |
|  1145.0 | -32.2707 |
|  1150.0 | -32.2759 |
|  1155.0 | -32.2815 |
|  1160.0 | -32.2857 |
|  1165.0 |  -32.291 |
|  1170.0 | -32.2961 |
|  1175.0 | -32.3012 |
|  1180.0 | -32.3063 |
|  1185.0 |   -32.31 |
|  1190.0 | -32.3143 |
|  1195.0 | -32.3188 |
|  1200.0 | -32.3225 |
|  1205.0 | -32.3271 |
|  1210.0 |   -32.33 |
|  1215.0 | -32.3338 |
|  1220.0 | -32.3375 |
|  1225.0 | -32.3408 |
|  1230.0 | -32.3445 |
|  1235.0 | -32.3459 |
|  1240.0 | -32.3492 |
|  1245.0 | -32.3526 |
|  1250.0 | -32.3551 |
|  1255.0 | -32.3573 |
|  1260.0 | -32.3592 |
|  1265.0 | -32.3599 |
|  1270.0 | -32.3628 |
|  1275.0 | -32.3643 |
|  1280.0 | -32.3653 |
|  1285.0 | -32.3668 |
|  1290.0 | -32.3675 |
|  1295.0 | -32.3679 |
|  1300.0 | -32.3689 |
|  1305.0 |  -32.369 |
|  1310.0 | -32.3686 |
|  1315.0 | -32.3682 |
|  1320.0 | -32.3681 |
|  1325.0 |  -32.367 |
|  1330.0 | -32.3663 |
|  1335.0 | -32.3654 |
|  1340.0 |  -32.364 |
|  1345.0 | -32.3618 |
|  1350.0 | -32.3599 |
|  1355.0 | -32.3574 |
|  1360.0 |  -32.355 |
|  1365.0 | -32.3525 |
|  1370.0 | -32.3495 |
|  1375.0 |  -32.346 |
|  1380.0 | -32.3422 |
|  1385.0 | -32.3387 |
|  1390.0 | -32.3344 |
|  1395.0 |   -32.33 |
|  1400.0 | -32.3252 |
|  1405.0 | -32.3201 |
|  1410.0 | -32.3148 |
|  1415.0 | -32.3091 |
|  1420.0 | -32.3031 |
|  1425.0 | -32.2968 |
|  1430.0 | -32.2903 |
|  1435.0 | -32.2833 |
|  1440.0 |  -32.276 |
|  1445.0 | -32.2682 |
|  1450.0 | -32.2604 |
|  1455.0 | -32.2518 |
|  1460.0 | -32.2434 |
|  1465.0 | -32.2347 |
|  1470.0 | -32.2254 |
|  1475.0 | -32.2158 |
|  1480.0 | -32.2057 |
|  1485.0 | -32.1953 |
|  1490.0 | -32.1844 |
|  1495.0 | -32.1737 |
|  1500.0 | -32.1621 |
|  1505.0 |   -32.15 |
|  1510.0 | -32.1378 |
|  1515.0 | -32.1252 |
|  1520.0 | -32.1124 |
|  1525.0 | -32.0984 |
|  1530.0 | -32.0853 |
|  1535.0 | -32.0701 |
|  1540.0 | -32.0559 |
|  1545.0 | -32.0409 |
|  1550.0 | -32.0257 |
|  1555.0 | -32.0099 |
|  1560.0 | -31.9935 |
|  1565.0 | -31.9766 |
|  1570.0 | -31.9602 |
|  1575.0 | -31.9421 |
|  1580.0 | -31.9243 |
|  1585.0 | -31.9057 |
|  1590.0 | -31.8869 |
|  1595.0 | -31.8678 |
|  1600.0 | -31.8478 |
|  1605.0 | -31.8278 |
|  1610.0 |  -31.807 |
|  1615.0 | -31.7865 |
|  1620.0 | -31.7654 |
|  1625.0 | -31.7432 |
|  1630.0 | -31.7202 |
|  1635.0 | -31.6972 |
|  1640.0 | -31.6742 |
|  1645.0 | -31.6504 |
|  1650.0 | -31.6266 |
|  1655.0 | -31.6015 |
|  1660.0 | -31.5755 |
|  1665.0 | -31.5493 |
|  1670.0 |  -31.522 |
|  1675.0 | -31.4972 |
|  1680.0 | -31.4687 |
|  1685.0 | -31.4413 |
|  1690.0 | -31.4133 |
|  1695.0 | -31.3851 |
|  1700.0 | -31.3551 |
|  1705.0 |  -31.325 |
|  1710.0 | -31.2953 |
|  1715.0 | -31.2628 |
|  1720.0 | -31.2331 |
|  1725.0 | -31.2007 |
|  1730.0 | -31.1687 |
|  1735.0 | -31.1362 |
|  1740.0 | -31.1018 |
|  1745.0 | -31.0677 |
|  1750.0 | -31.0323 |
|  1755.0 | -30.9974 |
|  1760.0 | -30.9614 |
|  1765.0 | -30.9283 |
|  1770.0 | -30.8888 |
|  1775.0 | -30.8525 |
|  1780.0 | -30.8135 |
|  1785.0 | -30.7747 |
|  1790.0 | -30.7388 |
|  1795.0 | -30.6932 |
|  1800.0 |  -30.655 |
|  1805.0 | -30.6165 |
|  1810.0 | -30.5761 |
|  1815.0 | -30.5358 |
|  1820.0 | -30.4948 |
|  1825.0 | -30.4506 |
|  1830.0 | -30.4038 |
|  1835.0 | -30.3595 |
|  1840.0 | -30.3155 |
|  1845.0 | -30.2681 |
|  1850.0 | -30.2216 |
|  1855.0 | -30.1722 |
|  1860.0 | -30.1263 |
|  1865.0 | -30.0786 |
|  1870.0 | -30.0337 |
|  1875.0 | -29.9794 |
|  1880.0 | -29.9313 |
|  1885.0 |  -29.882 |
|  1890.0 | -29.8319 |
|  1895.0 |  -29.783 |
|  1900.0 | -29.7289 |
|  1905.0 | -29.6744 |
|  1910.0 | -29.6206 |
|  1915.0 | -29.5702 |
|  1920.0 | -29.5185 |
|  1925.0 | -29.4646 |
|  1930.0 | -29.4103 |
|  1935.0 |  -29.355 |
|  1940.0 | -29.2985 |
|  1945.0 |  -29.238 |
|  1950.0 | -29.1734 |
|  1955.0 | -29.1179 |
|  1960.0 |  -29.062 |
|  1965.0 | -29.0035 |
|  1970.0 | -28.9435 |
|  1975.0 | -28.8827 |
|  1980.0 | -28.8191 |
|  1985.0 | -28.7576 |
|  1990.0 | -28.6971 |
|  1995.0 |  -28.631 |
|  2000.0 | -28.5618 |
|  2005.0 | -28.5035 |
|  2010.0 | -28.4346 |
|  2015.0 |   -28.37 |
|  2020.0 | -28.3039 |
|  2025.0 | -28.2366 |
|  2030.0 | -28.1661 |
|  2035.0 | -28.0976 |
|  2040.0 |   -28.03 |
|  2045.0 |  -27.958 |
|  2050.0 | -27.8891 |
|  2055.0 |  -27.813 |
|  2060.0 | -27.7438 |
|  2065.0 |  -27.673 |
|  2070.0 | -27.5989 |
|  2075.0 | -27.5234 |
|  2080.0 | -27.4504 |
|  2085.0 | -27.3737 |
|  2090.0 | -27.2978 |
|  2095.0 | -27.2264 |
|  2100.0 | -27.1469 |
|  2105.0 | -27.0727 |
|  2110.0 | -26.9851 |
|  2115.0 | -26.9134 |
|  2120.0 | -26.8313 |
|  2125.0 | -26.7518 |
|  2130.0 | -26.6726 |
|  2135.0 | -26.5887 |
|  2140.0 | -26.5091 |
|  2145.0 | -26.4242 |
|  2150.0 | -26.3356 |
|  2155.0 | -26.2523 |
|  2160.0 | -26.1669 |
|  2165.0 | -26.0896 |
|  2170.0 | -26.0028 |
|  2175.0 | -25.9093 |
|  2180.0 | -25.8308 |
|  2185.0 | -25.7391 |
|  2190.0 | -25.6506 |
|  2195.0 | -25.5658 |
|  2200.0 | -25.4709 |
|  2205.0 | -25.3813 |
|  2210.0 | -25.2889 |
|  2215.0 | -25.1977 |
|  2220.0 | -25.1066 |
|  2225.0 | -25.0157 |
|  2230.0 | -24.9264 |
|  2235.0 |  -24.828 |
|  2240.0 | -24.7374 |
|  2245.0 | -24.6415 |
|  2250.0 | -24.5453 |
|  2255.0 | -24.4459 |
|  2260.0 | -24.3504 |
|  2265.0 | -24.2543 |
|  2270.0 | -24.1558 |
|  2275.0 | -24.0547 |
|  2280.0 | -23.9525 |
|  2285.0 | -23.8608 |
|  2290.0 | -23.7566 |
|  2295.0 | -23.6445 |
|  2300.0 | -23.5378 |
|  2305.0 | -23.4406 |
|  2310.0 | -23.3395 |
|  2315.0 |  -23.242 |
|  2320.0 |  -23.141 |
|  2325.0 | -23.0349 |
|  2330.0 | -22.9295 |
|  2335.0 |  -22.823 |
|  2340.0 | -22.7141 |
|  2345.0 | -22.6117 |
|  2350.0 | -22.5076 |
|  2355.0 |  -22.395 |
|  2360.0 | -22.2841 |
|  2365.0 | -22.1779 |
|  2370.0 | -22.0659 |
|  2375.0 | -21.9554 |
|  2380.0 | -21.8472 |
|  2385.0 | -21.7321 |
|  2390.0 | -21.6232 |
|  2395.0 | -21.5075 |
|  2400.0 | -21.3933 |
|  2405.0 | -21.2783 |
|  2410.0 | -21.1693 |
|  2415.0 | -21.0544 |
|  2420.0 |  -20.939 |
|  2425.0 |  -20.826 |
|  2430.0 | -20.7064 |
|  2435.0 | -20.5905 |
|  2440.0 | -20.4752 |
|  2445.0 | -20.3573 |
|  2450.0 | -20.2371 |
|  2455.0 | -20.1201 |
|  2460.0 | -20.0077 |
|  2465.0 | -19.8815 |
|  2470.0 | -19.7634 |
|  2475.0 |  -19.636 |
|  2480.0 | -19.5183 |
|  2485.0 | -19.3963 |
|  2490.0 | -19.2743 |
|  2495.0 | -19.1573 |
|  2500.0 | -19.0283 |
|  2505.0 | -18.9125 |
|  2510.0 | -18.7854 |
|  2515.0 | -18.6534 |
|  2520.0 | -18.5357 |
|  2525.0 |  -18.408 |
|  2530.0 | -18.2792 |
|  2535.0 | -18.1558 |
|  2540.0 | -18.0311 |
|  2545.0 | -17.8922 |
|  2550.0 |  -17.774 |
|  2555.0 | -17.6483 |
|  2560.0 | -17.5228 |
|  2565.0 | -17.3844 |
|  2570.0 | -17.2624 |
|  2575.0 |  -17.134 |
|  2580.0 | -16.9993 |
|  2585.0 | -16.8704 |
|  2590.0 | -16.7393 |
|  2595.0 | -16.6116 |
|  2600.0 | -16.4775 |
|  2605.0 | -16.3486 |
|  2610.0 | -16.2112 |
|  2615.0 | -16.0841 |
|  2620.0 | -15.9509 |
|  2625.0 | -15.8136 |
|  2630.0 | -15.6835 |
|  2635.0 | -15.5495 |
|  2640.0 | -15.4134 |
|  2645.0 | -15.2714 |
|  2650.0 | -15.1418 |
|  2655.0 | -15.0049 |
|  2660.0 |   -14.87 |
|  2665.0 | -14.7341 |
|  2670.0 | -14.5842 |
|  2675.0 | -14.4583 |
|  2680.0 | -14.3223 |
|  2685.0 | -14.1824 |
|  2690.0 | -14.0375 |
|  2695.0 | -13.9105 |
|  2700.0 | -13.7664 |
|  2705.0 |  -13.617 |
|  2710.0 | -13.4923 |
|  2715.0 | -13.3401 |
|  2720.0 | -13.2111 |
|  2725.0 |  -13.074 |
|  2730.0 | -12.9255 |
|  2735.0 | -12.7842 |
|  2740.0 | -12.6487 |
|  2745.0 | -12.5038 |
|  2750.0 | -12.3623 |
|  2755.0 | -12.2288 |
|  2760.0 | -12.0772 |
|  2765.0 | -11.9354 |
|  2770.0 | -11.7951 |
|  2775.0 |  -11.653 |
|  2780.0 | -11.5113 |
|  2785.0 | -11.3661 |
|  2790.0 | -11.2141 |
|  2795.0 | -11.0617 |
|  2800.0 | -10.9387 |
|  2805.0 | -10.7877 |
|  2810.0 | -10.6475 |
|  2815.0 | -10.5006 |
|  2820.0 | -10.3499 |
|  2825.0 | -10.2097 |
|  2830.0 | -10.0619 |
|  2835.0 |  -9.9081 |
|  2840.0 |   -9.773 |
|  2845.0 |  -9.6194 |
|  2850.0 |  -9.4731 |
|  2855.0 |  -9.3195 |
|  2860.0 |  -9.1814 |
|  2865.0 |  -9.0313 |
|  2870.0 |   -8.886 |
|  2875.0 |  -8.7188 |
|  2880.0 |  -8.5807 |
|  2885.0 |  -8.4335 |
|  2890.0 |  -8.2921 |
|  2895.0 |  -8.1337 |
|  2900.0 |   -7.979 |
|  2905.0 |  -7.8055 |
|  2910.0 |  -7.6475 |
|  2915.0 |  -7.5266 |
|  2920.0 |  -7.4038 |
|  2925.0 |  -7.2709 |
|  2930.0 |    -7.08 |
|  2935.0 |  -6.9397 |
|  2940.0 |  -6.7885 |
|  2945.0 |   -6.625 |
|  2950.0 |  -6.4744 |
|  2955.0 |   -6.318 |
|  2960.0 |  -6.1571 |
|  2965.0 |  -6.0169 |
|  2970.0 |  -5.8588 |
|  2975.0 |  -5.6975 |
|  2980.0 |  -5.5464 |
|  2985.0 |  -5.4004 |
|  2990.0 |  -5.2592 |
| 2992.47 |  -5.1067 |

